#函数名
#函数功能描述
#支持的操作系统
#函数实现方式描述
#函数参数定义
#函数的输出

############查找类函数##############
#函数名:find_uid_o
#函数功能描述:除了root之外，查找系统中uid为0的用户，
#支持的操作系统:CentOS
#函数实现方式描述:
#函数参数定义:
#函数的输出:无或uid为0的用户的名称

#函数名:find_file_777
#函数功能描述:查找系统中属性为777的目录或文件名称
#支持的操作系统:CentOS
#函数实现方式描述:
#函数参数定义:
#函数的输出:列出系统中属性为777的目录或文件的名称以及位置

#函数名:find_cpu_over_use
#函数功能描述:
#支持的操作系统:CentOS
#函数实现方式描述:
#函数参数定义:
#函数的输出:



############检测类函数#############
#函数名：detec_os_version
#函数功能描述:检测操作系统的类型以及版本号
#支持的操作系统：CentOS
#函数实现方式描述
#函数参数定义
#函数的输出:操作系统名称，版本号 架构编号 x32 x64（CentOS 5.8 x64） 


#函数名：detec_os_most_use
#函数功能描述：检测是否安装了常用的软件wget,gcc,make,openssl
#支持的操作系统：
#函数实现方式描述：
#函数参数定义：
#函数的输出：未安装的软件的名称

#函数名:detec_os_rootkit
#函数功能描述:检测是否存在rootkit木马
#支持的操作系统:CentOS
#函数实现方式描述:
#函数参数定义:
#函数的输出:是或否




#函数名:detec_cpu_use
#函数功能描述:检测CPU的使用率
#支持的操作系统:CentOS
#函数实现方式描述:
#函数参数定义:
#函数的输出:当前时间，CPU的当前使用率

#函数名:detec_mem_use
#函数功能描述:检测内存的使用率
#支持的操作系统:CentOS
#函数实现方式描述:
#函数参数定义:
#函数的输出:当前时间，mem的当前使用率


#函数名:detec_disk_use
#函数功能描述:检测磁盘的使用率
#支持的操作系统:CentOS
#函数实现方式描述:
#函数参数定义:
#函数的输出:当前时间，磁盘的当前使用率

#函数名:detec_io_use
#函数功能描述:检测io的使用情况
#支持的操作系统:CentOS
#函数实现方式描述:
#函数参数定义:
#函数的输出:当前时间，IO的当前使用情况


#函数名:detec_nopasswd_user
#函数功能描述:检测密码为空的用户名
#支持的操作系统:CentOS
#函数实现方式描述:
#函数参数定义:
#函数的输出:列出密码为空的帐号名称



